Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Methods
The AnalysisDesignParameterMulti type exposes the following members.
Methods
Name | Description
GetValue
 Gets the value specified by the index of the analysis design parameter.
Modify
 Modifies an analysis design parameter. The ID has to be set.
 (Overrides AnalysisDesignParameterBase.Modify().)
Select
 Selects an analysis design parameter.
 (Overrides AnalysisObject.Select().)
SetValue
 Sets the value specified by the index of the analysis design parameter.
Top
See Also
Reference
AnalysisDesignParameterMulti Class
Tekla.Structures.Analysis Namespace